Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankEndRatioFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankStartRatioFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankEndStraightLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
Returns:
returns the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankStartStraightLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankEndOffsetLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
Returns:
Retruns the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankStartOffsetLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankEndAngledLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankStartAngledLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankEndLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.GetCrankStartLengthFormulaParams
Gets the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters.
Returns:
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarCrankOverridableParameters
Class used to store the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
Since:
2026